Make README data flow interactive
